---
kind: property
id: P:Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.ParametersDisplayOption
source: html/eae872b5-9687-1012-3a5e-5bcf9f3bf977.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.ParametersDisplayOption Property

Identifies how the parameters will be represented.

## Syntax (C#)
```csharp
public BendingDetailDisplayParametersOptions ParametersDisplayOption { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration